app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `follower`
WHERE `refUser` = '1'
AND `refUserFollower` = '1'
SELECT *
FROM `list`
JOIN `anime` ON `anime`.`idAnime` = `list`.`refAnime`
WHERE `refUser` = '2'
ORDER BY `addDate` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `follower`
WHERE `refUser` = '1'
SELECT *
FROM `list`
WHERE `status` = 'watching'
AND `refUser` = '1'
SELECT *
FROM `list`
WHERE `status` = 'completed'
AND `refUser` = '1'
SELECT *
FROM `list`
WHERE `status` = 'on hold'
AND `refUser` = '1'
SELECT *
FROM `list`
WHERE `status` = 'dropped'
AND `refUser` = '1'
SELECT *
FROM `list`
WHERE `status` = 'planning'
AND `refUser` = '1'
---
    public function profile ($refUser) {
      // Check if a session has started, if not return to login view
      if($this->session->get('userId')) {
        // Check if it's the profile of the current user
        $data["sessionData"] = $this->session;
        if($refUser == $this->session->get('userId')) {
          $idUser = $this->session->get('userId');
          $data['currentUser'] = true;
        }else {
          $idUser = $refUser;
        }


        // Getting data from requested
        $userTable = new UserModel();
        $listTable = new ListModel();
        $followerTable = new FollowerModel();

        $data['userData'] = $userTable->find($idUser);
        $data['userData']['follow'] = $followerTable->where(['refUser' => $idUser, 'refUserFollower' => $this->session->get('userId')])->countAllResults() > 0 ? true : false;
        $data['recentAnime'] =  $listTable->join('anime', 'anime.idAnime = list.refAnime')
                                ->where('refUser', $idUser)
                                ->orderBy('addDate', 'DESC')
                                ->findAll(10);
        $data['userData']['followers'] = 0;
        $data['userData']['followers'] = $followerTable->where('refUser', $idUser)->countAllResults();
        $data['userData']['watching'] = sizeof($listTable->where(['status' => 'watching', 'refUser' => $idUser])->findAll());
        $data['userData']['completed'] = sizeof($listTable->where(['status' => 'completed', 'refUser' => $idUser])->findAll());
        $data['userData']['onhold'] = sizeof($listTable->where(['status' => 'on hold', 'refUser' => $idUser])->findAll());
        $data['userData']['dropped'] = sizeof($listTable->where(['status' => 'dropped', 'refUser' => $idUser])->findAll());
        $data['userData']['planning'] = sizeof($listTable->where(['status' => 'planning', 'refUser' => $idUser])->findAll());