app/Controllers/Home.php

    public function reviews () {
      if($this->session->get('userId')) {
        $data["sessionData"] = $this->session;
      }
      $tableReviews = new ReviewModel();
      $tableLikes  = new LikeModel();
      $data['reviews'] = $tableReviews ->select("user.idUser, user.username, user.profilePic, user.engagement, anime.idAnime, anime.nameJap, anime.banner, review.content, review.idReview, DATE_FORMAT(review.publicationDate, '%b %d, %Y') as 'date', COUNT(like.refReview) as 'likes'")
                                      ->join('anime', 'anime.idAnime = review.refAnime')
                                      ->join('user', 'user.idUser = review.refUser')
                                      ->join('like', 'like.refReview = review.idReview', 'left')
                                      ->orderBy('COUNT(like.refReview)', 'DESC')
                                      ->groupBy('review.idReview')
                                      ->findAll(10);
      $data['currentUserLikes'] = $tableLikes -> where('refUser', $this->session->get('userId')) -> findAll();
---
SELECT min(yearBroadcast) as minYear
FROM `anime`
 LIMIT 1
SELECT *
FROM `anime`
SELECT *
FROM `user`
WHERE `user`.`idUser` = '1'

    public function details($idReview) {
      if($this->session->get('userId')) {
        $data["sessionData"] = $this->session;
      }
      $tableReviews = new ReviewModel();
      $tableLikes  = new LikeModel();
      $data['reviewData'] = $tableReviews  ->select("user.idUser, user.username, user.profilePic, user.engagement, anime.idAnime, anime.nameJap, anime.banner, review.content, review.idReview, DATE_FORMAT(review.publicationDate, '%b %d, %Y') as 'date', COUNT(like.refReview) as 'likes'")
                                        ->join('anime', 'anime.idAnime = review.refAnime')
                                        ->join('user', 'user.idUser = review.refUser')
                                        ->join('like', 'like.refReview = review.idReview', 'left')
                                        ->orderBy('COUNT(like.refReview)', 'DESC')
                                        ->groupBy('review.idReview')
                                        ->find($idReview);
      $data['currentUserLikes'] = $tableLikes -> where('refUser', $this->session->get('userId')) -> findAll();
---
SELECT *
FROM `anime`
WHERE `idAnime` = '21'
SELECT *
FROM `user`
WHERE `user`.`idUser` = '1'

    public function profile ($refUser) {
      // Check if a session has started, if not return to login view
      if($this->session->get('userId')) {
        // Check if it's the profile of the current user
        $data["sessionData"] = $this->session;
        if($refUser == $this->session->get('userId')) {
          $idUser = $this->session->get('userId');
          $data['currentUser'] = true;
        }else {
          $idUser = $refUser;
        }


        // Getting data from requested
        $userTable = new UserModel();
        $listTable = new ListModel();
        $followerTable = new FollowerModel();
        $reviewTable = new ReviewModel();

        $data['userData'] = $userTable  ->select("idUser, username, profilePic, banner, location, gender, engagement, bio, DATE_FORMAT(birthDate, '%b %d, %Y') as 'birthDate', DATE_FORMAT(joinDate, '%b %d, %Y') as 'joinDate'")->find($idUser);
        $data['userData']['follow'] = $followerTable->where(['refUser' => $idUser, 'refUserFollower' => $this->session->get('userId')])->countAllResults() > 0 ? true : false;
        $data['recentAnime'] =  $listTable->join('anime', 'anime.idAnime = list.refAnime')
                                ->where('refUser', $idUser)
                                ->orderBy('updateDate', 'DESC')
                                ->findAll(5);
        $data['topAnime'] = $listTable->join('anime', 'anime.idAnime = list.refAnime')
                                      ->where('refUser', $idUser)
                                      ->orderBy('score', 'DESC')
                                      ->findAll(5);
        $data['userData']['reviews'] = $reviewTable ->select("anime.idAnime, anime.nameJap, review.idReview, DATE_FORMAT(review.publicationDate, '%b %d, %Y') as 'date', COUNT(like.refReview) as 'likes'")
                                        ->join('anime', 'anime.idAnime = review.refAnime')
                                        ->join('user', 'user.idUser = review.refUser')
                                        ->join('like', 'like.refReview = review.idReview', 'left')
                                        ->orderBy('COUNT(like.refReview)', 'DESC')
                                        ->groupBy('review.idReview')
                                        ->where('review.refUser', $idUser)
                                        ->findAll(5);
        $data['userData']['followers'] = 0;
        $data['userData']['followers'] = $followerTable->where('refUser', $idUser)->countAllResults();
---
SELECT `idUser`, `username`, `profilePic`, `banner`, `location`, `gender`, `engagement`, `bio`, DATE_FORMAT(birthDate, '%b %d, %Y') as 'birthDate', DATE_FORMAT(joinDate, '%b %d, %Y') as 'joinDate'
FROM `user`
WHERE `user`.`idUser` = '1'
SELECT COUNT(*) AS `numrows`
FROM `follower`
WHERE `refUser` = '1'
AND `refUserFollower` = '1'
SELECT *
FROM `list`
JOIN `anime` ON `anime`.`idAnime` = `list`.`refAnime`
WHERE `refUser` = '1'
ORDER BY `updateDate` DESC
 LIMIT 5
SELECT *
FROM `list`
JOIN `anime` ON `anime`.`idAnime` = `list`.`refAnime`
WHERE `refUser` = '1'
ORDER BY `score` DESC
 LIMIT 5
SELECT `anime`.`idAnime`, `anime`.`nameJap`, `review`.`idReview`, DATE_FORMAT(review.publicationDate, '%b %d, %Y') as 'date', COUNT(like.refReview) as 'likes'
FROM `review`
JOIN `anime` ON `anime`.`idAnime` = `review`.`refAnime`
JOIN `user` ON `user`.`idUser` = `review`.`refUser`
LEFT JOIN `like` ON `like`.`refReview` = `review`.`idReview`
WHERE `review`.`refUser` = '1'
GROUP BY `review`.`idReview`
ORDER BY COUNT(like.refReview) DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `follower`
WHERE `refUser` = '1'

    public function animelist($refUser, $status) {
        // Check if a session has started, if not return to login view
        if($this->session->get('userId')) {
          // Check if it's the profile of the current user
          $status = $status > 6 ? 0 : $status;
          $data['typeList'] = $status;
          $data["sessionData"] = $this->session;
          if($refUser == $this->session->get('userId')) {
            $idUser = $this->session->get('userId');
            $data['currentUser'] = true;
          }else {
            $idUser = $refUser;
          }

          $userTable = new UserModel();
          $listTable = new ListModel();
          switch ($status) {
            case 0:
              $data['animelist'] = $listTable->join('anime', 'anime.idAnime = list.refAnime')
              ->where('refUser', $idUser)
              ->orderBy('updateDate', 'DESC')
              ->findAll();
---
SELECT *
FROM `list`
JOIN `anime` ON `anime`.`idAnime` = `list`.`refAnime`
WHERE `refUser` = '1'
ORDER BY `updateDate` DESC
 LIMIT 5

              ->findAll();
              break;
            case 4:
              $data['animelist'] = $listTable->join('anime', 'anime.idAnime = list.refAnime')
              ->where(['refUser' => $idUser, 'status' => 'dropped'])
              ->orderBy('updateDate', 'DESC')
              ->findAll();
              break;
            case 5:
              $data['animelist'] = $listTable->join('anime', 'anime.idAnime = list.refAnime')
              ->where(['refUser' => $idUser, 'status' => 'planning'])
              ->orderBy('updateDate', 'DESC')
              ->findAll();
---
SELECT *
FROM `list`
JOIN `anime` ON `anime`.`idAnime` = `list`.`refAnime`
WHERE `refUser` = '1'
ORDER BY `updateDate` DESC