app/Controllers/Home.php

SELECT max(yearBroadcast) as maxYear
FROM `anime`
 LIMIT 1
---
    public function explore () {
      if($this->session->get('userId')) {
        $data["sessionData"] = $this->session;
      }
        $tableAnime = new AnimeModel();

        $res = $tableAnime->select('max(yearBroadcast) as maxYear')->first(); // Get the max year

SELECT `user`.`idUser`, `user`.`username`, `user`.`profilePic`, `user`.`engagement`, `anime`.`idAnime`, `anime`.`nameJap`, `anime`.`banner`, `review`.`content`, `review`.`idReview`, DATE_FORMAT(review.publicationDate, '%b %d, %Y') as 'date', COUNT(like.refReview) as 'likes'
FROM `review`
JOIN `anime` ON `anime`.`idAnime` = `review`.`refAnime`
JOIN `user` ON `user`.`idUser` = `review`.`refUser`
LEFT JOIN `like` ON `like`.`refReview` = `review`.`idReview`
WHERE `anime`.`idAnime` = '3'
GROUP BY `review`.`idReview`
ORDER BY COUNT(like.refReview) DESC
 LIMIT 3
SELECT `idAnime`, `nameEng`, `nameJap`, `synopsis`, DATE_FORMAT(airingStart, '%b %d, %Y') as 'airingStart', DATE_FORMAT(airingFinish, '%b %d, %Y') as 'airingFinish', `yearBroadcast`, `season`, `studio`, `type`, `totalEpisodes`, `duration`, `source`, `banner`, `img`
FROM `anime`
WHERE `idAnime` = '3'
SELECT `character`.`nameCharacter`, `character`.`surnameCharacter`, `va`.`nameVa`, `va`.`surnameVa`, `character`.`img` as `charimg`, `va`.`img` as `vaimg`
FROM `anime`
JOIN `anime_character` ON `anime_character`.`refAnime` = `anime`.`idAnime`
JOIN `character` ON `character`.`idCharacter` = `anime_character`.`refChar`
JOIN `va_character` ON `va_character`.`refChar` = `character`.`idCharacter`
JOIN `va` ON `va`.`idVa` = `va_character`.`refVa`
WHERE `anime`.`idAnime` = '3'
SELECT *
FROM `list`
WHERE `refUser` = '4'
AND `refAnime` = '3'
---
    public function anime ($idAnime) {
      $tableAnime = new AnimeModel();
      $tableList = new ListModel();
      $tableReviews = new ReviewModel();
      $tableLikes  = new LikeModel();

      $data['reviews'] = $tableReviews ->select("user.idUser, user.username, user.profilePic, user.engagement, anime.idAnime, anime.nameJap, anime.banner, review.content, review.idReview, DATE_FORMAT(review.publicationDate, '%b %d, %Y') as 'date', COUNT(like.refReview) as 'likes'")
                                      ->join('anime', 'anime.idAnime = review.refAnime')
                                      ->join('user', 'user.idUser = review.refUser')
                                      ->join('like', 'like.refReview = review.idReview', 'left')
                                      ->orderBy('COUNT(like.refReview)', 'DESC')
                                      ->groupBy('review.idReview')
                                      ->where('anime.idAnime', $idAnime)
                                      ->findAll(3);

      $data['animeData'] = $tableAnime->select("idAnime, nameEng, nameJap, synopsis, DATE_FORMAT(airingStart, '%b %d, %Y') as 'airingStart', DATE_FORMAT(airingFinish, '%b %d, %Y') as 'airingFinish', yearBroadcast, season, studio, type, totalEpisodes, duration, source, banner, img")
                                      ->where('idAnime', $idAnime)->findAll();
      $data['char_va'] = $tableAnime->select("character.nameCharacter, character.surnameCharacter, va.nameVa, va.surnameVa, character.img as charimg, va.img as vaimg")
                                    ->join('anime_character', 'anime_character.refAnime = anime.idAnime')
                                    ->join('character', 'character.idCharacter = anime_character.refChar')
                                    ->join('va_character', 'va_character.refChar = character.idCharacter')
                                    ->join('va', 'va.idVa = va_character.refVa')
                                    ->where('anime.idAnime', $idAnime)
                                    ->findAll();
      $data['medianScore'] = $tableList->select("CAST((score) AS DECIMAL (10, 2)) as score")->find($idAnime);
      if($this->session->get('userId')) {
        $data["sessionData"] = $this->session;
        $data["isInList"] = $tableList->where(['refUser' => $this->session->get('userId'), 'refAnime' => $idAnime])->findAll();

SELECT *
FROM `user`
WHERE `user`.`idUser` = '1'
SELECT COUNT(*) AS `numrows`
FROM `follower`
WHERE `refUser` = '1'
---
    public function profile ($refUser) {
      // Check if a session has started, if not return to login view
      if($this->session->get('userId')) {
        // Check if it's the profile of the current user
        $data["sessionData"] = $this->session;
        if($refUser == $this->session->get('userId')) {
          $idUser = $this->session->get('userId');
          $data['currentUser'] = true;
        }else {
          $idUser = $refUser;
        }


        // Getting data from requested
        $userTable = new UserModel();
        $listTable = new ListModel();
        $followerTable = new FollowerModel();
        $reviewTable = new ReviewModel();

        $data['userData'] = $userTable  ->select("idUser, username, profilePic, banner, location, gender, engagement, bio, DATE_FORMAT(birthDate, '%b %d, %Y') as 'birthDate', DATE_FORMAT(joinDate, '%b %d, %Y') as 'joinDate'")->find($idUser);
        $data['userData']['follow'] = $followerTable->where(['refUser' => $idUser, 'refUserFollower' => $this->session->get('userId')])->countAllResults() > 0 ? true : false;